{"db":[{"tag":0,"article":"ye","title":"test"},{"tag":1,"article":"no","title":"test2"},{"tag":"word @1","article":"maybe","title":"test3"},{"tag":3,"article":"test data","title":"another test"},{"tag":4,"article":"test data","title":"more test"},{"tag":5,"article":"<p>Amid the hustle and bustle of the <strong>RSA Security Conference</strong>&#xA0;in San Francisco last week, researchers at RSA released a startling report that received very little press coverage relative to its overall importance. The report detailed&#xA0;a malware campaign that piggybacked on a popular piece of software used by system administrators at some of the nation&#x2019;s largest companies. Incredibly, the report did not name the affected software, and the vendor in question has apparently chosen to bury its breach disclosure. This post is an attempt to remedy that.</p><p>The RSA report detailed the threat from a malware operation the company dubbed &#x201C;<strong>Kingslayer</strong>.&#x201D; According to RSA, the attackers compromised the Web site of a company that sells software to help Windows system administrators better parse and understand Windows event logs. RSA said the site hosting the event log management software was only compromised for two weeks &#x2014; from April 9, 2015 to April 25, 2015 &#x2014; but that the intrusion was likely far more severe than the short duration of the intrusion suggests.</p><p>That&#x2019;s because in addition to compromising the download page for this software package,<em> the attackers also hacked the company&#x2019;s software update server</em>, <em>meaning any company that already had the software installed prior to the site compromise would likely have automatically downloaded the compromised version when the software regularly checked for available updates</em> (as it was designed to do).</p><div><a href=\"https://krebsonsecurity.com/wp-content/uploads/2017/02/kingslayertimeline.png\"><img src=\"https://krebsonsecurity.com/wp-content/uploads/2017/02/kingslayertimeline-580x247.png\"></a><p>Image: RSA</p></div><p>RSA said that in April 2016 it &#x201C;sinkholed&#x201D; or took control over the Web site that the malware used as a control server &#x2014; <strong>oraclesoft[dot]net</strong> &#x2014; and from there they were able to see indicators of which organizations might still be running the backdoored software. According to RSA, the victims included five major defense contractors; four major telecommunications providers; 10+ western military organizations; more than two dozen Fortune 500 companies; 24 banks and financial institutions; and at least 45 higher educational institutions.</p><p>RSA declined to name the software vendor whose site was compromised, but said the company issued a security notification on its Web site on June 30, 2016 and updated the notice on July 17, 2016 at RSA&#x2019;s request following findings from further investigation into a defense contractor&#x2019;s network. RSA&#xA0;also noted that the victim software firm had a domain name ending in &#x201C;.net,&#x201D; and that the product in question was installed as a Windows installer package file (.msi).</p><p>Using that information, it wasn&#x2019;t super difficult to find the product in question. An Internet search for the terms &#x201C;event log security notification april 2015&#x201D; turns up <a href=\"http://www.eventid.net/evlog/evlogsecnote.asp\" target=\"_blank\">a breach notification</a>&#xA0;from June 30, 2016 about a software package called&#xA0;<strong>EVlog</strong>, produced by an <strong>Altair Technologies Ltd.</strong> in Mississauga, Ontario. The timeline mentioned in the breach notification exactly matches the timeline laid out in the RSA report.</p><p>As far as breach disclosures go, this one is about the lamest I&#x2019;ve ever seen given the sheer number of companies that Altair Technologies <a href=\"http://www.eventid.net/whosubscribed.asp\" target=\"_blank\">lists on its site as subscribers to eventid.net</a>, an online service tied to EVlog. I could not locate a single link to this advisory anywhere on the company&#x2019;s site, nor could I find evidence that Altair Technologies had made any effort via social media or elsewhere to call attention to the security advisory; it is simply buried in the site. A screenshot of the original, much shorter, version of that notice is <a href=\"https://krebsonsecurity.com/wp-content/uploads/2017/02/evlogcomp.png\" target=\"_blank\">here</a>.</p><div><img src=\"https://krebsonsecurity.com/wp-content/uploads/2017/02/eventidsubscribers.png\"><p>Just some of the customers of Eventid.</p></div><p>Perhaps the company emailed its subscribers about the breach, but that seems doubtful. The owner of Altair Technologies, a programmer named <strong>Adrian Grigorof</strong>, did not respond to multiple requests for comment.</p><p>&#x201C;This attack is unique in that it appears to have specifically targeted Windows system administrators of large and, perhaps, sensitive organizations,&#x201D; RSA said in its report. &#x201C;These organizations appeared on a list of customers still displayed on the formerly subverted software vendor&#x2019;s Web site. This is likely not coincidence, but unfortunately, nearly two years after the Kingslayer campaign was initiated, we still do not know how many of the customers listed on the website may have been breached, or possibly are still compromised by the Kingslayer perpetrators.&#x201D;</p><p>It&#x2019;s perhaps worth noting that this isn&#x2019;t the only software package sold by Altair Technologies. An analysis of Eventid.net shows that the site is hosted on a server along with three other domains, <strong>eventreader.com</strong>, <strong>firegen.com</strong> and <strong>grigorof.com</strong> (the&#xA0;latter being a vanity domain of the software developer). The other two domains &#x2014; eventreader.com and firegen.com &#x2014; correspond to different software products sold by Altair.</p><p>The fact that those software titles appear to have been sold and downloadable from the same server as eventid.net (going back as far as 2010) suggests that those products may have been similarly compromised. However, I could find no breach notification mentioning those products.&#xA0;<a href=\"http://www.firegen.com/testimonials.html\" target=\"_blank\">Here is a list of companies</a> that Altair says are customers of Firegen; they include <strong>3M</strong>, <strong>DirecTV</strong>, <strong>Dole Food Company</strong>, <strong>EDS</strong>, <strong>FedEx</strong>, <strong>Ingram Micro</strong>, <strong>Northrop Grumman</strong>, <strong>Symantec</strong> and the <strong>U.S. Marshals Service</strong>.</p><p>RSA calls these types of intrusions &#x201C;supply chain attacks,&#x201D; in that they provide one compromise vector to multiple targets. It&#x2019;s not difficult&#xA0;to see from the customer lists of the software titles mentioned above why an attacker might salivate over the idea of hacking an entire suite of software designed for corporate system administrators.</p><p>&#x201C;Supply chain exploitation attacks, by their very nature, are stealthy and have the potential to provide the attacker access to their targets for a much longer period than malware delivered by other common means, by evading traditional network analysis and detection tools,&#x201D; wrote RSA&#x2019;s <strong>Kent Backman</strong> and <strong>Kevin Stear</strong>. &#x201C;Software supply chain attacks offer considerable &#x2018;bang for the buck&#x2019; against otherwise hardened targets. In the case of Kingslayer, this especially rings true because the specific system-administrator-related systems most likely to be infected offer the ideal beachhead and operational staging environment for system exploitation of a large enterprise.&#x201D;</p><p>A copy of the RSA report is available&#xA0;<a href=\"https://www.rsa.com/en-us/resources/kingslayer-a-supply-chain-attack\" target=\"_blank\">here</a> (PDF).</p><p><strong>Update, 3:35 p.m. ET:</strong>&#xA0;I first contacted Altair Technologies&#x2019; Grigorof on Feb. 9. I heard back from him today,&#xA0;post-publication. Here is his statement:</p><p>&#x201C;Rest assured that the EvLog incident has been reviewed by a high-level security research company and the relevant information circulated to the interested parties, including antivirus companies. We are under an NDA regarding their internal research though the attack has already been categorized as a supply chain attack.&#x201D;</p><p>&#x201C;The notification that you&#x2019;ve seen was based on their recommendations and they had our full cooperation on tracking down the perpetrators. It&#x2019;s obviously not as spectacular as a high visibility, major company breach and surely there wasn&#x2019;t anything in the news &#x2013; we are not that famous.&#x201D;</p><p>&#x201C;I&#x2019;m sure a DDoS against our site would remain unnoticed while the attack against your blog site made headlines all over the world. We also don&#x2019;t expect that a large organization would use EvLog to monitor their servers &#x2013; it is a very simple tool. We identified the problem within a couple of weeks (vs months or years that it takes for a typical breach) and imposed several layers of extra security in order prevent this type of problem.&#x201D;</p><p>&#x201C;To answer your direct question about notifications, we don&#x2019;t keep track on who downloads and tries this software, therefore there is no master list of users to notify. Any anonymous user can download it and install it. I&#x2019;m not sure what you mean by &#x2018;you still haven&#x2019;t disclosed this breach&#x2019; &#x2013; it is obviously disclosed and the notification is on our website. The notification is quite explicit in my opinion &#x2013; the user is warned that even if EvLog is removed, there may still be other malware that used EvLog as a bridgehead.&#x201D;</p><p>My take on this statement? I find it to be wholly incongruent. Altair&#xA0;Technologies obviously went to great lengths to publish who its major customers were on the same sites it was using to the sell the software in question. Now the owner says he has&#xA0;no idea who uses the software. That he would say it was never intended to be used in major organizations seems&#xA0;odd in contrast.</p><p>Finally, publishing a statement somewhere in the thick of your site and not calling attention to it on any other portion of your site isn&#x2019;t exactly a disclosure. If nobody knows that there&#x2019;s a breach notice there to find, how should they be expected to find it? Answer: They&#x2019;re not, because it wasn&#x2019;t intended for that purpose. This statement hasn&#x2019;t convinced me to the contrary.</p><p><strong>Update, 11:13 p.m. ET:</strong> Altair Technologies now has a link to the breach notification on the homepage for Evlog: http://www.eventid.net/evlog/</p>\r \t\t\t\t\r\r \t\t\t\t\t\t\t\t  \r\r\r\r\t\t\t\t \r\t\t\t\t\r\r\r\t\t\t\t<p>Tags: <a href=\"https://krebsonsecurity.com/tag/adrian-grigorof/\">Adrian Grigorof</a>, <a href=\"https://krebsonsecurity.com/tag/eventid-net/\">EventID.net</a>, <a href=\"https://krebsonsecurity.com/tag/eventreader-com/\">eventreader.com</a>, <a href=\"https://krebsonsecurity.com/tag/firegen-com/\">firegen.com</a>, <a href=\"https://krebsonsecurity.com/tag/grigorof-com/\">grigorof.com</a>, <a href=\"https://krebsonsecurity.com/tag/kent-backman/\">Kent Backman</a>, <a href=\"https://krebsonsecurity.com/tag/kevin-stear/\">Kevin Stear</a>, <a href=\"https://krebsonsecurity.com/tag/kingslayer/\">Kingslayer</a>, <a href=\"https://krebsonsecurity.com/tag/rsa/\">RSA</a></p>\r\t\t\t\t<p>\r\t\t\t\t\t<small>\r\t\t\t\t\t\tThis entry was posted on Tuesday, February 21st, 2017 at 12:44 pm\t\t\t\t\t\tand is filed under <a href=\"https://krebsonsecurity.com/category/other/\">Other</a>.\r\t\t\t\t\t\tYou can follow any comments to this entry through the <a href=\"https://krebsonsecurity.com/2017/02/how-to-bury-a-major-breach-notification/feed/\">RSS 2.0</a> feed.\r\r\t\t\t\t\t\t\t\t\t\t\t\t\tYou can skip to the end and leave a comment. Pinging is currently not allowed.\r\r\t\t\t\t\t\t\r\t\t\t\t\t</small>\r\t\t\t\t</p>","title":"How to Bury a Major Breach Notification —  Krebs on Security"}],"currentArticle":5}
