{"db":[{"tag":0,"article":"ye","title":"test"},{"tag":1,"article":"no","title":"test2"},{"tag":"word @1","article":"maybe","title":"test3"},{"tag":3,"article":"test data","title":"another test"},{"tag":4,"article":"test data","title":"more test"},{"tag":5,"article":"<p class='anchor''>It&#x2019;s been a remarkable week for cyber justice. On Thursday, a Ukrainian man who hatched a plan in 2013 to send heroin to my home and then call the cops when the drugs arrived was sentenced to 41 months in prison for unrelated cybercrime charges. Separately, a 19-year-old American who admitted to being part of a hacker group that sent a heavily-armed police force to my home in 2013 was sentenced to three years probation.</p><div><img src=\"https://krebsonsecurity.com/wp-content/uploads/2014/06/s-vovnenko.png\"><p class='anchor''>Sergei &#x201C;Fly&#x201D; Vovnenko, in an undated photo. In a letter to this author following his arrest, Vovnenko said he forgave me for &#x201C;doxing&#x201D; him &#x2014; printing his real name and image &#x2014; on my site.</p></div><p class='anchor''><strong>Sergey Vovnenko</strong>, a.k.a. &#x201C;Fly,&#x201D; &#x201C;Flycracker&#x201D; and &#x201C;MUXACC1,&#x201D; pleaded guilty last year to aggravated identity theft and conspiracy to commit wire fraud. Prosecutors said Vovnenko operated a network of more than 13,000 hacked computers, using them to harvest credit card numbers and other sensitive information.</p><p class='anchor''>When I first became acquainted with Vovnenko in 2013, Fly was the administrator of the fraud forum &#x201C;thecc[dot]bz,&#x201D; an exclusive and closely guarded Russian language board dedicated to financial fraud and identity theft.</p><p class='anchor''>After I secretly gained access to his forum, I learned he&#x2019;d hatched a plot to have heroin sent to my home and to have one of his forum lackeys call the police when the drugs arrived.</p><p class='anchor''>I explained this whole ordeal <a href=\"http://krebsonsecurity.com/2015/10/hacker-who-sent-me-heroin-faces-charges-in-u-s/\" target=\"_blank\">in great detail in 2015</a>, when Vovnenko initially was extradited from Italy to face charges here in the United States. In short, the antics didn&#x2019;t end when I foiled his plot to get me arrested for drug possession, and those antics likely contributed to his arrest and to this guilty plea.</p><p class='anchor''>Vovnenko contested his extradition from Italy, and in so doing spent roughly 15 months in arguably <a href=\"http://www.thelocal.it/20140615/italys-jailbirds-are-packed-like-sardines\" target=\"_blank\">Italy&#x2019;s worst prison</a>. During that time, he seemed to have turned his life around, sending me postcards at Christmas time and even an apparently heartfelt apology letter.</p><div><img src=\"https://krebsonsecurity.com/wp-content/uploads/2015/10/flypostcardback-580x503.png\"><p class='anchor''>Seasons greetings from my pen pal, Flycracker.</p></div><p class='anchor''>On Thursday, a judge in New Jersey sentenced Vovnenko to 41 months in prison, three years of supervised released and ordered him to pay restitution of $83,368.</p><p class='anchor''>Separately, a judge in Washington, D.C. handed down a sentence of three year&#x2019;s probation to <strong>Eric Taylor</strong>, a hacker probably better known by his handle &#x201C;<a href=\"http://twitter.com/CosmoTheGod\" target=\"_blank\">Cosmo the God</a>.&#x201D;</p><p class='anchor''>Taylor was among several men involved in making a false report to my local police department at the time about a supposed hostage situation at our Virginia home. In response, a <a href=\"http://krebsonsecurity.com/2013/03/the-world-has-no-room-for-cowards/\" target=\"_blank\">heavily-armed police force surrounded my home</a> and put me in handcuffs at gunpoint before the police realized it was all a dangerous hoax known as &#x201C;swatting.&#x201D;</p><p class='anchor''>CosmoTheGod rocketed to&#xA0;Internet infamy in 2013 when he and a number of other hackers set up the Web site <a href=\"http://krebsonsecurity.com/2013/03/credit-reports-sold-for-cheap-in-the-underweb/\" target=\"_blank\">exposed[dot]su</a>, which &#x201C;doxed&#x201D; dozens of public officials and celebrities by publishing the address, Social Security numbers and other personal information on the former <strong>First Lady Michelle Obama</strong>, the then-director of the FBI and the U.S. attorney general, among others. The group also swatted many of the people they doxed.</p><p class='anchor''><div><a href=\"https://krebsonsecurity.com/wp-content/uploads/2014/03/exposed-su.png\"><img src=\"https://krebsonsecurity.com/wp-content/uploads/2014/03/exposed-su-600x462.png\"></a><p class='anchor''>Exposed[dot]su was built with the help of identity information obtained and/or stolen from ssndob[dot]ru.</p></div>Taylor and his co-conspirators were able to dox so many celebrities and public officials because they hacked a Russian identity theft service called <a href=\"https://krebsonsecurity.com/2014/03/who-built-the-id-theft-service-ssndob-ru/\" target=\"_blank\">ssndob[dot]ru</a>. That service in turn <a href=\"http://krebsonsecurity.com/2013/09/data-broker-giants-hacked-by-id-theft-service/\" target=\"_blank\">relied upon compromised user accounts</a> at data broker giant <strong>LexisNexis</strong> to pull personal and financial data on millions of Americans.</p><p class='anchor''>At least two other young men connected to the exposed[dot]su conspiracy have already been sentenced to prison.</p><div><img src=\"https://krebsonsecurity.com/wp-content/uploads/2017/02/ctg.png\"><p class='anchor''>Eric &#x201C;CosmoTheGod&#x201D; Taylor, in a recent selfie posted to his Twitter profile.</p></div><p class='anchor''>Among them was Mir Islam, a 22-year-old Brooklyn man who was <a href=\"https://krebsonsecurity.com/2016/07/serial-swatter-stalker-and-doxer-mir-islam-gets-just-1-year-in-jail/\" target=\"_blank\">sentenced last year to two years in prison for doxing and swatting</a>, and for cyberstalking a young woman whom he also admitted to swatting. Because he served almost a year of detention prior to his sentencing, Islam was only expected to spend roughly a year in prison, although it appears he was released before even serving the entire year.</p><p class='anchor''>Hours after his sentencing, Taylor reached out to KrebsOnSecurity via Facetime to apologize for his actions.&#xA0;Taylor, a California native, said he is trying to turn his life around, and that he has even started his own <a href=\"https://cinder.com/\" target=\"_blank\">cybersecurity consultancy</a>.</p><p class='anchor''>&#x201C;I live in New York City now, have a baby on the way and am really trying to get my shit together finally,&#x201D; Taylor said.</p><p class='anchor''>If Taylor&#x2019;s physical&#xA0;appearance is any indication, he is indeed turning over a new leaf. At the time he was involved in publishing exposed[dot]su, the six-foot, seven-inch CosmoTheGod was <a href=\"https://www.wired.com/2012/09/cosmo-the-god-who-fell-to-earth/\" target=\"_blank\">easily a hundred pounds heavier than he is now</a>.</p><p class='anchor''><span>Unfortunately, not everyone in Taylor&#x2019;s former crew is making changes for the better. According to Taylor, his former co-conspirator Islam was recently re-arrested after allegedly cyberstalking Taylor&#x2019;s girlfriend. That stalking claim could not be independently confirmed, however court documents show that Islam was indeed re-arrested and incarcerated last month in New York.</span></p><div><img src=\"https://krebsonsecurity.com/wp-content/uploads/2016/07/islamsentencing-580x307.png\"><p class='anchor''>Mir Islam, at his sentencing hearing last year. Sketches copyright by Hennessy / CourtroomArt.com</p></div>\r \t\t\t\t\r\r \t\t\t\t\t\t\t\t  \r\r\r\r\t\t\t\t \r\t\t\t\t\r\r\r\t\t\t\t<p class='anchor''>Tags: <a href=\"https://krebsonsecurity.com/tag/cosmo-the-god/\">Cosmo the God</a>, <a href=\"https://krebsonsecurity.com/tag/eric-taylor/\">Eric Taylor</a>, <a href=\"https://krebsonsecurity.com/tag/exposed-su/\">exposed.su</a>, <a href=\"https://krebsonsecurity.com/tag/flycracker/\">Flycracker</a>, <a href=\"https://krebsonsecurity.com/tag/heroin/\">heroin</a>, <a href=\"https://krebsonsecurity.com/tag/lexisnexis/\">LexisNexis</a>, <a href=\"https://krebsonsecurity.com/tag/mir-islam/\">Mir Islam</a>, <a href=\"https://krebsonsecurity.com/tag/sergey-vovnenko/\">Sergey Vovnenko</a></p>\r\t\t\t\t<p class='anchor''>\r\t\t\t\t\t<small>\r\t\t\t\t\t\tThis entry was posted on Friday, February 17th, 2017 at 2:46 pm\t\t\t\t\t\tand is filed under <a href=\"https://krebsonsecurity.com/category/other/\">Other</a>.\r\t\t\t\t\t\tYou can follow any comments to this entry through the <a href=\"https://krebsonsecurity.com/2017/02/men-who-sent-swat-team-heroin-to-my-home-sentenced/feed/\">RSS 2.0</a> feed.\r\r\t\t\t\t\t\t\t\t\t\t\t\t\tYou can skip to the end and leave a comment. Pinging is currently not allowed.\r\r\t\t\t\t\t\t\r\t\t\t\t\t</small>\r\t\t\t\t</p>","title":"Men Who Sent Swat Team, Heroin to My Home Sentenced —  Krebs on Security","domain":"krebsonsecurity.com"}],"currentArticle":5}
